from keybert import KeyBERT
from flair.embeddings import FlairEmbeddings, StackedEmbeddings

model = StackedEmbeddings(
    [
        FlairEmbeddings("./backward-best-lm.pt"),
        FlairEmbeddings("./forward-best-lm.pt"),
    ]
)

kw_model = KeyBERT(model=model)

doc = '''
Під час засідання в середу очільники оборонних відомств країн НАТО погодились збільшити підтримку України, посилити власні засоби стримування й розробити заходи захисту критично важливої інфраструктури.

Як повідомляє кореспондент "Європейської правди" з Брюсселя, про це журналістам у середу на пресконференції заявив генеральний секретар Альянсу Єнс Столтенберг.

"Я вітаю нові зобов’язання щодо підтримки (України) з боку держав-членів Альянсу, зокрема нові поставки важкої техніки й військові тренування. Україна має вікно можливостей для зміни балансу сил, і час має значення ", – зазначив він, не уточнивши, про яку саме військову допомогу йдеться.

Водночас Столтенберг уточнив, що деякі члени Альянсу погодились на нові внески до Комплексного пакета допомоги НАТО, з якого фінансується постачання Україні продовольства, медикаментів, палива, протидронних систем і понтонних мостів.

Крім того, зазначив генсек НАТО, було погоджено збільшити "спеціалізовану підтримку" партнерів Альянсу – Грузії, Молдови та Боснії і Герцеговини – для розбудови їхніх оборонних спроможностей та взаємосумісності з НАТО.

Що стосується посилення стримування НАТО, йдеться про погодження нового політичного керівництва для оборонного планування, яке відображатиме виклики з боку повномасштабної війни РФ проти України, тероризму й дій Китаю.

Також НАТО погодився збільшити виробництво озброєнь, які вичерпуються через війну в Україні, переглянувши їхні цільові показники, й ухвалити багатонаціональний проєкт щодо створення складів боєприпасів НАТО і розбудови наземної протиповітряної оборони.
'''

keywords = kw_model.extract_keywords(doc, keyphrase_ngram_range=(1, 1), stop_words=None)

print(keywords)

# Result: 
# [('тероризму', 0.6764), ('підтримку', 0.6693), ('взаємосумісності', 0.6613), ('стримування', 0.6594), ('грузії', 0.6588)]
